micropython/micropython/ports/atmel-samd/boards/bdmicro_vina_d51/mpconfigboard.h
// More than one revision of this board is available.
// This board specifies the most up to date PCB Revision

#define MICROPY_HW_BOARD_NAME "BDMICRO VINA-D51"
#define MICROPY_HW_MCU_NAME "samd51n20"

#define CIRCUITPY_MCU_FAMILY samd51

#define BOARD_HAS_CRYSTAL 1

#define DEFAULT_I2C_BUS_SCL (&pin_PA12)
#define DEFAULT_I2C_BUS_SDA (&pin_PA13)
#define DEFAULT_UART_BUS_TX (&pin_PB21)
#define DEFAULT_UART_BUS_RX (&pin_PB20)
#define DEFAULT_SPI_BUS_SCK (&pin_PC28)
#define DEFAULT_SPI_BUS_MISO (&pin_PB23)
#define DEFAULT_SPI_BUS_MOSI (&pin_PC27)
#define MICROPY_HW_LED_STATUS (&pin_PA23)
#define MICROPY_HW_LED_RX (&pin_PC05)
#define MICROPY_HW_LED_TX (&pin_PC06)

// USB is always used internally so skip the pin objects for it.
#define IGNORE_PIN_PA24 1
#define IGNORE_PIN_PA25 1
